//2. Создать папку enums в папке src, в ней файл Color.ts, 
// который экспортирует enum различных цветов (обязательно красный, зеленый, синий (RGB)).
//  Создать метод внутри app.component, который проверяет, является ли переданный цвет основным, 
// а основных у нас 3 цвета (красный, синий, зеленый) и возвращает нам true/false 

//3. Далее создать метод, которая сохраняет в локальное хранилище дату последнего захода на страницу. 
//Вызывать ее в конструкторе.

//4. Далее создать метод, которая сохраняет в localStorage количество заходов на страницу.  Вызывать ее в конструкторе.
export enum Colors {
  RED = 'RED',
  GREEN = 'GREEN',
  BLUE = 'BLUE'
}

