//5. Создать файл collection.ts, который реализует внутри себя класс Collection, 
// работающий с любым типом данных. Внутри реализовать методы:

 // - получить все элементы коллекции getElements
 // - получить определенный элемент коллекции getThisElements
 // - очистить коллекцию deleteElements
 // - удалить определенный элемент коллекции deleteThisElements
 // - заменить определенный элемент коллекции replaseThisElements

//Реализовать коллекцию с двумя разными источниками данных
export class Collection {

}